[
  {
    "question": "A 16-year-old female adolescent was referred to our hospital with severe hypertension (systolic pressure 178 mmHg), which was first detected 7 months prior to presentation during a routine annual physical examination. She complained of intermittent headache for about 1 year, and her previous blood pressure, measured 1 month prior to her detection of hypertension, had been normal. She showed mild hypokalemia (3.4 mmol/L) in a routine blood test, and an additional workup considering secondary hypertension was planned. Despite taking amlodipine (0.1 mg/kg twice a day), her blood pressure remained uncontrolled.\nUpon admission to our hospital, her systolic and diastolic blood pressures were 155 mmHg (>99th percentile) and 111 mmHg (>99th percentile) respectively. She was 162.8 cm tall (50th–75th percentile) and weighed 55 kg (50th–75th percentile). Physical examination including ophthalmological examination revealed no abnormality other than hypertension, and her family history was negative for hypertension or renal diseases. Laboratory examination revealed normal levels of hemoglobin (14.4 g/dL), serum creatinine (0.57 mg/dL), serum total cholesterol (144 mg/dL), and normal urinalysis. Serum sodium, potassium, chloride, and total carbon dioxide levels were 134 mmol/L, 3.4 mmol/L, 102 mmol/L, and 27 mmol/L, respectively. Plasma renin activity was 9.83 ng/mL/hr (normal, 0.5–3.3 ng/mL/hr), and serum aldosterone level was 77.3 ng/dL (normal, 4–48 ng/dL). Urinary levels of vanillylmandelic acid, epinephrine, norepinephrine, dopamine, metanephrine, and normetanephrine were normal, and plasma levels of epinephrine, norepinephrine, and dopamine were also normal. Chest radiography, electrocardiography, and echocardiography showed normal findings. Renal Doppler ultrasonography revealed an avascular bilobed cyst in the lower pole of the right kidney (). Abdominal computed tomography (CT) angiography showed bilaterally normal renal arteries and an eccentric soft tissue component at the peripheral aspect of the cystic lesion (). The mass remained unenhanced during the arterial phase, and its margin was indistinguishable from the surrounding tissue (). During the delayed phase, its eccentric capsule showed enhancement, and an intact mass could be observed (), consistent with CT findings of JGC tumors.\nA right partial nephrectomy was performed, and a clear resection margin was identified. The well-encapsulated mass measured 2.5 cm ×2.2 cm×2.0 cm in size with a partially cystic-appearing cut surface. Microscopic examination revealed sheets of polygonal tumor cells with amphophilic cytoplasm. Immunohistochemical examination showed that the tumor cells stained positive for CD34 and focally positive for CD117 (C-Kit) and smooth muscle actin. ()\nPostoperatively, her blood pressure returned to normal (105/63 mmHg) without using any antihypertensive medication. On the 3rd postoperative day, the plasma renin activity (0.52 ng/mL/hr), serum aldosterone (3.9 ng/dL), and serum potassium (3.6 mmol/L) levels returned to normal. Her blood pressure and laboratory findings remained within the reference range over the next 3 years postoperatively until her last follow-up. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "141.042",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.ideal_body_weight import ibw_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\nweight_value = 55.0\nweight_unit = \"kg\"\nheight_value = 162.8\nheight_unit = \"cm\"\nsex = \"Female\"\ncreatinine_value = 0.57\ncreatinine_unit = \"mg/dL\"\nage_value = 16\nage_unit = \"years\"\n\nbmi_input = {\n    \"weight\": (weight_value, weight_unit),\n    \"height\": (height_value, height_unit),\n}\nbmi_result = bmi_calculator_explanation(bmi_input)\nbmi = float(bmi_result[\"Answer\"])\n\nibw_input = {\n    \"height\": (height_value, height_unit),\n    \"sex\": sex,\n    \"age\": age_value,\n}\nibw_result = ibw_explanation(ibw_input)\nibw = float(ibw_result[\"Answer\"])\n\nabw_input = {\n    \"weight\": (weight_value, weight_unit),\n    \"height\": (height_value, height_unit),\n    \"sex\": sex,\n    \"age\": age_value,\n}\nabw_result = abw_explanation(abw_input)\nabw = float(abw_result[\"Answer\"])\n\nif bmi < 18.5:\n    chosen_weight = weight_value\nelif 18.5 <= bmi < 25:\n    chosen_weight = min(weight_value, ibw)\nelse:\n    chosen_weight = abw\n\ncreatinine_clearance_input = {\n    \"weight\": (chosen_weight, \"kg\"),\n    \"height\": (height_value, height_unit),\n    \"sex\": sex,\n    \"creatinine\": (creatinine_value, creatinine_unit),\n    \"age\": (age_value, age_unit),\n}\nclearance_result = generate_cockcroft_gault_explanation(creatinine_clearance_input)\nresult = clearance_result[\"Answer\"]\nprint(result)"
  },
  {
    "question": "A 56-year-old man was admitted to the renal unit of the tertiary university hospital with symptoms of polyuria with nocturia, and polydipsia with severe thirst for the past 2 months. Initially, the patient visited a local clinic and was diagnosed as type 2 DM with a fasting blood sugar, 150mg/dL. Despite being controlled hyperglycemia with an oral hypoglycemic agent, he continued drinking daily more than 8 L of cold water (about 10 bottles of refrigerated water, 750 ml capacity) and passed large amounts of urine frequently. He had no specific history including head trauma or mental disorder, and denied any pertinent family history. The patient showed no signs of systemic illness such as fever or arthralgia, or neurologic symptoms involving the central nervous system. He has been working as a gardener with 176 cm in height and 68 kg in weight (71 kg before this event). The physical examination was unremarkable with blood pressure of 132/70 mmHg, pulse rate of 80/min, respiratory rate of 16/min, and temperature of 36.8℃. In the laboratory findings, his white blood cell count was 9,700/mm3; hemoglobin, 13.4 g/dL; platelet, 376×103/mm3; sodium, 140 mEq/L; potassium, 3.8 mEq/L; blood urea nitrogen (BUN), 12 mg/dL; creatinine, 1.0 mg/dL and osmolality 295 mOsm/kg water. HbA1c was 7.2% and post-prandial glucose was checked around 180mg/dl with fasting blood sugar of 140 mg/dL. In urine analysis, the urine pH was 6.0; specific gravity 1.006; albumin (-); glucose (-); WBC 0-4/HPF; RBC 0-2/HPF, and osmolality 140mOsm/kg water. Fluid intake and output in 24 hours recorded 9 L in oral water intake from water containers and 11.7 L in urine output. In hormone assays, ACTH was 25.2 pg/mL (reference value, 6.0-76.0 pg/mL), prolactin 8 µg/L (reference value, 0-15 µg/L), cortisol 9.8 µg/dL (referencel value, 5-25 µg/dL), hGH 2.26 ng/mL (reference value, 0.5-17 ng/mL), and TSH 0.99 µU/mL (reference value, 0.5-4.7 µU/mL). Also, angiotensin converting enzyme (ACE) activity was within normal range (reference value, <40 U/L).\nOn hospital day 5, the patient underwent a water deprivation test according to the method of Miller-Moses test because of persistent polydipsia and polyuria despite blood glucose control. The results are shown in . During dehydration, the patient lost 3kg (4.4% of body weight), and urine osmolality remained hypotonic below 130 mOsm/kg. Basal ADH level was 5.18 pg/dL, and the repeat ADH level following the stimulation by water deprivation was 3.95 pg/dL, which revealed no increment despite the increased serum osmolality up to 300 mOsm/kg from the baseline levels of 285 to 295 mOsm/kg. One puff (5 µg) of desmopressin nasal spray resulted in the increase of urine osmolality to 266 mOsm/kg (>100% increase from the baseline level, 126 mOsm/kg) and in the marked reduction of urine output from 200-410 ml/hr to 44-60 ml/hr. These results were compatible with CDI,, whose causes would be mostly idiopathic because of normal findings in hypothalamus and hypophysis in magnetic resonance imaging (MRI) scan of sella ().\nOn discharge (hospital day 9), the dose of desmopressin nasal spray (minirin nasal spray®) was adjusted to 1 puff per 12 hrs (10 µg/day), and urine output was markedly reduced to below 2-3 L/day with no more intense thirst. Also, DM was controlled with fasting blood sugar below 115 mg/dL by metformin (novamet GR® 500mg bid) and American Diabetes Association (ADA) recommended diet. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "79.333",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.ideal_body_weight import ibw_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\nweight = 68\nheight = 176\nsex = \"Male\"\nage = 56\ncreatinine = 1.0\n\nbmi_input = {\"weight\": (weight, \"kg\"), \"height\": (height, \"cm\")}\nbmi_result = bmi_calculator_explanation(bmi_input)\nbmi = float(bmi_result[\"Answer\"])\nibw_input = {\"height\": (height, \"cm\"), \"sex\": sex, \"age\": age}\nibw_result = ibw_explanation(ibw_input)\nibw = float(ibw_result[\"Answer\"])\nabw_input = {\"weight\": (weight, \"kg\"), \"height\": (height, \"cm\"), \"sex\": sex, \"age\": age}\nabw_result = abw_explanation(abw_input)\nabw = float(abw_result[\"Answer\"])\n\nif bmi < 18.5:\n    adjusted_weight = weight\nelif 18.5 <= bmi < 25:\n    adjusted_weight = min(ibw, weight)\nelse:\n    adjusted_weight = abw\n\ninput_variables = {\n    \"weight\": (adjusted_weight, \"kg\"),\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"creatinine\": (creatinine, \"mg/dL\"),\n    \"age\": (age, \"years\"),\n}\nresult = generate_cockcroft_gault_explanation(input_variables)[\"Answer\"]\nprint(result)"
  },
  {
    "question": "In 2008, a 59-year-old Japanese woman was admitted for evaluation of renal disease. RA had been diagnosed at another hospital in 1972 when she presented with bilateral arthropathy of the hands, knees, ankles, and feet. Treatment was started with a combination of a gold preparation and nonsteroidal anti-inflammatory drugs (NSAIDs), but was not been effective. Prednisolone (PSL; 15 mg daily) and bucillamine (BUC; 200 mg daily) were started in 1987, but her disease remained active. Methotrexate (MTX; 5 mg daily) was started in 1995 but was discontinued because of nausea. In 2002, urinary protein was found to be positive by a dipstick urine test, and BUC was stopped. Then treatment was continued with PSL (5 mg/day) and loxoprofen (50 mg/day). However, urinary protein excretion increased in 2007, and serum creatinine (Cre) was elevated to 1.96 mg/dL.\nOn admission, the patient was 154.2 cm tall and weighed 44.0 kg, with a blood pressure of 128/60 mmHg and temperature of 36.4 °C. Physical examination did not reveal any abnormalities of the heart and lungs. The joints of her hands, knees, ankles, and feet showed bilateral swelling and deformity. In addition, the lower extremities were edematous. Her cervical spine was unstable, with flexion causing numbness in the upper limbs.\nLaboratory findings were as follows: serum Cre was 4.2 mg/dL, the estimated glomerular filtration rate (eGFR) was 9.3 mL/min/1.73m3, C-reactive protein (CRP) was 0.9 mg/dL, and SAA was 43.2. In addition, rheumatoid factor (RF) was positive at 59 U/mL (normal: < 10), and cyclic citrullinated peptide (CCP) antibodies were positive at 218.5 (normal < 4.5). 24-hour urinary protein excretion was 6.5 g, and the urine sediment contained 1 – 5 red cells per high-power field (HPF). The disease activity score (DAS)-CRP was 7.1. Radiographs showed deformation of the finger and foot joints as well as atlantoaxial joint subluxation. Renal biopsy was performed for evaluation of her kidney disease.\nRenal biopsy\nLight microscopic examination of a biopsy specimen containing 4 glomeruli revealed global sclerosis in all 4. There was severe tubular atrophy, and tubulointerstitial fibrosis occupied ~ 95% of the entire renal cortex. All 4 glomeruli contained multinodular structures of amorphous material with a PAM-positive border. This material was positive for Congo-red and amyloid A, but was negative for κ and λ chains, β-2 microglobulin, and transthyretin (). Electron microscopy showed randomly arranged fibrils measuring 8 – 12 nm in diameter corresponding to the amyloid deposits (f). AA amyloidosis was diagnosed from these findings. In addition to the glomeruli, amyloid deposits were mainly observed in the interlobular artery walls and tubulointerstitium (e). Endoscopic biopsy of the stomach, duodenum, and colon revealed AA-positive deposits in the small arteries and tissues of the submucosal layer (a).\nClinical course\nPSL was discontinued, and administration of a soluble tumor necrosis factor (TNF) receptor inhibitor (etanercept; 25 mg every 2 weeks) was started in May 2008, but it was not effective. By September 2008, Cre was increased to 6.0 mg/dL. She underwent surgery to prepare an arteriovenous fistula for hemodialysis. Etanercept was discontinued, and a humanized anti-interleukin-6 receptor antibody (tocilizumab; 8 mg/kg = 360 mg/month) was started in February 2009. After 3 months, her CRP decreased to 0.0 mg/dL, and the DAS28-CRP sore was 2.12. After 2 years of tocilizumab therapy, urinary protein excretion was decreased to 1.1 g/day, and Cre was 4.0 mg/dL. Subsequently, Cre remained in the range of 4.5 – 5.0 mg/dL until December 2017. While Cre increased to 7.1 mg/dL after initiation of treatment with denosumab (a human monoclonal antibody that binds to receptor activator of NFκB ligand) for osteoporosis in October 2018, it remained at 7.0 mg/dL in June 2019 ().\nGastroduodenal biopsy was performed in May 2013 and May 2017. On both occasions, no amyloid deposits were detected in the submucosal blood vessels (b). What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "21.467",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.ideal_body_weight import ibw_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\nweight = 44.0\nheight = 154.2\nsex = \"Female\"\nage = 59\ncreatinine = 4.2\n\nbmi_input = {\n    \"weight\": (weight, \"kg\"),\n    \"height\": (height, \"cm\"),\n}\nbmi_result = bmi_calculator_explanation(bmi_input)[\"Answer\"]\nbmi_float = float(bmi_result)\n\nif bmi_float < 18.5:\n    abw = weight\nelif 18.5 <= bmi_float < 25:\n    ibw_input = {\n        \"height\": (height, \"cm\"),\n        \"sex\": sex,\n        \"age\": age,\n    }\n    ibw = float(ibw_explanation(ibw_input)[\"Answer\"])\n    abw = min(weight, ibw)\nelse:\n    abw_input = {\n        \"weight\": (weight, \"kg\"),\n        \"height\": (height, \"cm\"),\n        \"sex\": sex,\n        \"age\": age,\n    }\n    abw = float(abw_explanation(abw_input)[\"Answer\"])\n\ncg_input = {\n    \"weight\": (abw, \"kg\"),\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"creatinine\": (creatinine, \"mg/dL\"),\n    \"age\": (age, \"years\"),\n}\nresult = str(generate_cockcroft_gault_explanation(cg_input)[\"Answer\"])\nprint(result)"
  },
  {
    "question": "A 34-year-old man was admitted for evaluation of worsening pedal edema. He was apparently healthy until four years back, when he developed edema of both feet and nonpruritic macular skin rash involving both lower limbs. Subsequently, he was detected to have hypertension, proteinuria and mild renal failure (6 months ago). He had no history of arthralgia, Raynaud's phenomenon, paraesthesia or gastrointestinal hemorrhage.\nSix weeks prior to admission in our centre, he developed weakness of left upper and lower limbs with slurring of speech and was hospitalized elsewhere. A computerized tomographic scan of head had revealed an infarct in the right middle cerebral artery territory and he was treated with aspirin, statins, and antihypertensives. He made a complete recovery but was detected to have renal failure and was referred to us for further evaluation.\nHe weighed 74 kg and had a height of 174 cm. He had pallor and bilateral pitting pedal edema. There was no skin rash or lymphadenopathy. Blood pressure was 140/90 mmHg. Examination of cardiovascular system, respiratory system, and abdomen was normal. There were no neurological deficits.\nInvestigations revealed hemoglobin of 8.79 gm/dL, platelet count of 112000/mm3, total WBC count of 7960/mm3 - with a normal differential count, ESR of 40 mm at end of first hour. Urinalysis showed protein ++++, 6-8 RBCs/HPF; and 24 hour urine protein was 4420 mg. Blood urea was 72 mg/dL and serum creatinine was 3.1 mg/dL with normal serum levels of electrolytes. Liver function tests, PT and aPTT were normal. Serum albumin was 3.6 gm%, serum globulin 3.8 g/dL and serum cholesterol 240 mg/dL. Serum protein electrophoresis was normal. Blood and urine cultures were sterile. HBsAg, antihepatitis C virus (HCV) and HIV antibodies were negative VDRL, cANCA, pANCA, antiphospholipid antibodies, ANA, antids DNA were negative. Serum homocysteine [12 µmol/L] was normal and serum complement levels were reduced (C3:70 mg/dL, C4:18 mg/dL). Serum cryoglobulin assay was positive. On PAGE electrophoresis, the mobility was suggestive of mixed cryoglobulins. HCV RNA was negative in serum [polymerase chain reaction (PCR)]. Qualitative analysis for HCV RNA [by reverse transcriptase-PCR (RT-PCR)] in the cryoprecipitate was negative []. Doppler study of extra cranial carotid and vertebral vessels was normal. Ultra sonogram of abdomen, ECG, and echocardiogram were normal. Bone marrow examination was normal. X-rays of chest, skull spine, and pelvis were normal. Kidney biopsy showed lobular accentuation of glomeruli with mesangial proliferation, mild endocapillary proliferation, and double contour of glomerular basement membrane on light microscopy. Intracapillary eosinophilic PAS positive hyaline deposits were noted []. Interstitium showed mononuclear infiltrates. Immunofluorescence showed mesangial and capillary granular positivity for C3 IgG and IgM. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "33.034",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.ideal_body_weight import ibw_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\nweight = 74\nheight = 174\nage = 34\nsex = \"Male\"\ncreatinine = 3.1\n\nbmi_variables = {\n    \"weight\": (weight, \"kg\"),\n    \"height\": (height, \"cm\")\n}\nbmi_result = bmi_calculator_explanation(bmi_variables)\nbmi_value = float(bmi_result[\"Answer\"])\n\nibw_variables = {\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"age\": age\n}\nibw_result = ibw_explanation(ibw_variables)\nibw_value = float(ibw_result[\"Answer\"])\n\nabw_variables = {\n    \"weight\": (weight, \"kg\"),\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"age\": age\n}\nabw_result = abw_explanation(abw_variables)\nabw_value = float(abw_result[\"Answer\"])\n\nif bmi_value < 18.5:\n    adjusted_weight = weight\nelif 18.5 <= bmi_value < 25:\n    adjusted_weight = min(weight, ibw_value)\nelse:\n    adjusted_weight = abw_value\n\ninput_variables = {\n    \"weight\": (adjusted_weight, \"kg\"),\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"creatinine\": (creatinine, \"mg/dL\"),\n    \"age\": (age, \"years\"),\n}\nfinal = generate_cockcroft_gault_explanation(input_variables)\nresult = str(final[\"Answer\"])\nprint(result)"
  },
  {
    "question": "A 67-year-old Japanese woman underwent OWHTO to treat SPONK that had occurred in the left medial femoral condyle (Fig. ). The patient reported the following history of the present illness. Pain in the left knee joint initially occurred at 1 year and 4 months before admission, without any particular trigger. Her former treating physician had provided conservative treatments such as oral administration of anti-inflammatory analgesics, rehabilitation including quadriceps muscle training, and guidance on the use of a cane to relieve weight bearing. However, this treatment was not successful in relieving her symptoms, and she was referred to our department for surgery. The patient had a history of hypertension and hyperlipidemia, and she had been taking oral candesartan and atorvastatin. The patient was a housewife with no noteworthy aspects related to social, family, or environmental history. On physical examination, the patient had a height of 157 cm, a body weight of 62 kg, and a body mass index of 25.2 kg/m2. She reported feeling pain in the medial joint space of the knee during walking, as well as during climbing or descending stairs. At the time of the first admission, her systolic/diastolic blood pressure was 165/97 mmHg. Table provides an overview of the patient’s pain scores in the knee joint, ROM of the knee joint, and knee joint function. Neurological examination revealed no abnormal findings. Similarly, laboratory findings at the time of the first admission did not indicate any abnormality: total protein 7.3 g/dl, albumin 4.6 g/dl, aspartate aminotransferase 22 U/L, alanine aminotransferase 18 U/L, lactate dehydrogenase 213 U/L, alkaline phosphatase 297 U/L, γ-glutamyl transferase 18 U/L, total bilirubin 0.6 mg/dl, Na 142 mEq/L, Cl 104 mEq/L, K 4.5 mEq/L, blood urea nitrogen 21.4 mg/dl, creatinine 0.56 mg/dl, Ca 9.7 mg/dl, inorganic phosphorus 3.7 mg/dl, leukocytes 5100/μl, erythrocytes 5.00 × 106/μl, hemoglobin 14.4 g/dl, hematocrit 43.6%, and platelets 263 × 103/μl.\nThe HAL-SJ treatment program was divided into five phases []. Phase 1 consisted of preoperative observation from the day of hospital admission until the day of surgery. The patient’s thigh circumference and lower leg length were measured preoperatively to adjust the HAL-SJ to the patient’s physical size, which would ensure appropriate training. We palpated the patient’s quadriceps muscles (vastus medialis, rectus femoris, and vastus lateralis) and attached electrodes to each muscle to detect the bioelectric potentials of the long axis along the belly of each muscle. We instructed the patient to perform knee extension and to contract her quadriceps. On the basis of these data, we instructed the patient to simulate the knee extension training, which would be performed postoperatively. Specifically, the patient sat with her lower leg hanging down naturally, and the height of the chair was adjusted so that the patient’s feet were not in contact with the floor. The patient performed ten knee extensions with HAL-SJ assistance, using the muscle that exhibited the largest bioelectric potential amplitude.\nPhase 2 involved surgery (day of surgery). The patient underwent OWHTO (Figs. and ) using TomoFix (DePuy Synthes, Bettlach, Switzerland), artificial bone (OSferion60, β-tricalcium phosphate; Olympus Terumo Biomaterials, Tokyo, Japan), and biplanar osteotomy, as described by Takeuchi et al. []. The preoperative weight-bearing line (WBL) percentage [], calculated on the basis of an anteroposterior weight-bearing radiograph of the affected leg in full knee extension, was 29.6%. The surgery was planned with a target postoperative WBL percentage of 62.5%. The actual enlarged angle and distance of osteotomy were 5.5 degrees and 7 mm, respectively.\nPhase 3 consisted of postoperative observation from day 1 to day 7 postoperatively. For postoperative rehabilitation, partial weight bearing was allowed after a non-weight-bearing period of 2 weeks, and full weight bearing began at 4 weeks postoperatively. The patient received rehabilitation training under the guidance of a physical therapist (ROM exercises and muscle-strengthening training) for 20–40 minutes each day, 5 days per week, from the first postoperative day until discharge. For ROM exercises, continuous passive motion training began on the first postoperative day for 1 hour per day and continued every day until discharge. On postoperative day 7, we attached electrodes to the quadriceps muscle to detect the bioelectric potential along the long axis of the rectus femoris muscle belly (Fig. ). Then, the patient was instructed to perform active knee extension exercises that involved contracting her quadriceps, thus simulating training with HAL-SJ (Fig. ).\nPhase 4 consisted of HAL-SJ therapy from postoperative day 8 to discharge. The CVC mode of HAL-SJ serves to support the patient’s voluntary motion on the basis of voluntary muscle activity and the assistive torque provided to the knee joint []. In this study, we used the CVC mode, which allowed the operator to adjust the degree of physical support to maintain the patient’s comfort while gradually reducing support as training progressed. In addition to the regular rehabilitation program (Fig. ), the patient performed HAL-JS-assisted knee extension exercises while sitting, which consisted of five sets of ten repetitions per set, twice per week (Fig. ). The training was performed six times before the patient was discharged (postoperative days 8, 10, 15, 17, 22, and 24). The mean training duration, including the time required to put on the HAL-SJ, was 15.5 ± 1.4 minutes (15 minutes, 16 minutes, 17 minutes, 16 minutes, 13 minutes, and 16 minutes during training sessions 1, 2, 3, 4, 5, and 6, respectively). There were no adverse events related to the use of HAL-SJ, and the patient was discharged 30 days after the surgery.\nPhase 5 consisted of post-HAL-SJ therapy observation from discharge until 3 months after the end of HAL-SJ therapy, during which the following indicators were assessed: EL, assessed as the difference between the maximum knee joint extension angle during passive exercise and that during active exercise; knee pain rated on the visual analogue scale (VAS); isometric knee extension muscle strength (IKEMS); active ROM before surgery, before and after HAL-SJ training, and at 1 and 3 months after the end of training; and the Japanese Orthopaedic Association (JOA) score [] before surgery, at discharge, and at 1 and 3 months after the end of training. Furthermore, we used lateral radiographs to measure the tibial slope angle (TSA) and Insall-Salvati ratio (ISR) as indicators of patellar tendon shortening before surgery and after implant removal at 1 year after the operation [] (Fig. ). Measurement of knee ROM was performed using goniometry, and the landmarks used in the measurements were the greater trochanter of the femur, proximal head of the fibula, and lateral malleolus. Goniometry was used because it has been reported that goniometric measurements of ROM are more reliable than visual observation, with an accuracy of up to 1.0 degree []. The maximal IKEMS of the operated leg was assessed with the patient in a sitting position, with the hips and knees flexed at 90 degrees. A μTas F-1 handheld dynamometer (Anima Corp., Tokyo, Japan) was fixed to the chair, and two measurements were recorded. Each trial lasted 3–5 seconds, with 30 seconds of rest between trials. The higher score of two valid trials was recorded. All measurements were performed by a single trained physical therapist to eliminate interobserver variability. The EL, VAS, IKEMS, and ROM results are shown in Table . The EL improved from 3 degrees preoperatively to 0 degrees at the end of the sixth HAL-SJ training session, but it returned to 3 degrees at 1 and 3 months after the end of the training. When we compared results obtained before training against those obtained after each of the six training sessions, we observed that three sessions produced improved EL and three sessions produced improved or relatively constant VAS scores immediately after training. However, for the other three sessions, the patient reported increased pain immediately after training, with the greatest increase in pain reported immediately after the first HAL-SJ training session, when the VAS score was 1.7 times higher immediately after training than before training. The EL improved after training sessions 1 and 3, when the patient reported increased knee pain (expressed as the VAS score). However, the EL did not change after training sessions 2 and 4, when the patient reported less knee pain (improved VAS score immediately after training). The patient did not refuse to undergo training because of increased pain. The IKEMS value was the largest preoperatively (17.6 kgf) and decreased to its lowest value (30% of the preoperative strength) before the first HAL-SJ intervention at 8 days after the operation. The IKEMS remained relatively constant throughout HAL-SJ training but recovered to the preoperative value during follow-up (18.7 and 16.6 kgf at 1 and 3 months, respectively, after completion of HAL-SJ training). The active ROM also recovered to the preoperative value by the end of the sixth HAL-SJ training session. Thereafter, the extension ROM did not change, but the flexion ROM was maintained or improved. The JOA score decreased from 60 points preoperatively to 55 points at discharge, but it improved with time, reaching 65 and 85 points at 1 and 3 months, respectively, after the end of HAL-SJ training. Whereas the TSA was maintained at 13.1 degrees before and after the surgery, the ISR decreased from 1.13 preoperatively to 0.97 postoperatively. At 6 months after surgery, the passive ROM was 0–135 degrees, and the JOA score was 90 points. There were no complications throughout the preparation, surgery, or rehabilitation process. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "84.025",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.ideal_body_weight import ibw_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\nweight_value = 62\nweight_unit = \"kg\"\nheight_value = 157\nheight_unit = \"cm\"\nsex = \"Female\"\nage_value = 67\nage_unit = \"years\"\ncreatinine_value = 0.56\ncreatinine_unit = \"mg/dL\"\n\nbmi_input = {\n    \"weight\": (weight_value, weight_unit),\n    \"height\": (height_value, height_unit)\n}\nbmi_result = bmi_calculator_explanation(bmi_input)\nbmi = float(bmi_result[\"Answer\"])\n\nibw_input = {\n    \"height\": (height_value, height_unit),\n    \"sex\": sex,\n    \"age\": int(age_value)\n}\nibw_result = ibw_explanation(ibw_input)\nibw = float(ibw_result[\"Answer\"])\n\nif bmi >= 25:\n    abw_input = {\n        \"weight\": (weight_value, weight_unit),\n        \"height\": (height_value, height_unit),\n        \"sex\": sex,\n        \"age\": int(age_value)\n    }\n    abw_result = abw_explanation(abw_input)\n    used_weight = float(abw_result[\"Answer\"])\nelif 18.5 <= bmi < 25:\n    used_weight = min(weight_value, ibw)\nelse:\n    used_weight = weight_value\n\ninput_variables = {\n    \"weight\": (used_weight, \"kg\"),\n    \"height\": (height_value, height_unit),\n    \"sex\": sex,\n    \"creatinine\": (creatinine_value, creatinine_unit),\n    \"age\": (age_value, age_unit)\n}\ncreat_clear_result = generate_cockcroft_gault_explanation(input_variables)\nresult = str(creat_clear_result[\"Answer\"])\nprint(result)"
  },
  {
    "question": "This is a 61-year-old woman who presented with diabetic symptoms and was misclassified as having type 1 diabetes with negative autoimmune-related type 1 diabetes antibodies (Tyrosine Phosphatase antibodies and Glutamic acid Decarboxylase antibodies). She was referred to our center due to uncontrolled diabetes despite the high doses of insulin and the coexistence of severe insulin resistance and decreased body mass index (BMI: 19.4 kg/m2). Age of presentation was 29 years and for the following 30 years she was treated with multiple daily insulin injections with high insulin requirements (5 IU/kg/day) together with metformin 2 g/day for 30 years, but constantly displaying poor glycemic control. Dyslipidemia was observed at the age of 35 years with raised cholesterol levels and severe hypertriglyceridemia despite intense lipid lowering therapy which lately consisted of the combination of fenofibrate 145 mg, rosuvastatin 40 mg/day and omega-3 fatty acids/day together with restricted fat intake. Hypertension was observed at the age of 5 years, and lately treated with the combination of nifedipine 120 mg/day, eplerenone 25 mg/day and hydrochlorothiazide 25 mg/day.\nShe also had micro- and macrovascular complications of diabetes indicating constantly insufficient glycemic control. She presented peripheral diabetic neuropathy (distal symmetric polyneuropathy) and nephropathy (eGFR: 43 ml/min, albuminuria: 314 mg/24 h). She also suffered from severe cardiovascular disease including peripheral artery disease and hypertrophic cardiomyopathy. Peripheral artery disease presented as intermittent claudication and carotid stenosis, for which she had a right carotid endarterectomy at the age of 52 years old. She was managed with clopidogrel 75 mg/day.\nShe had menarche at the age of 11, followed by irregular menstruation and then premature menopause at the age of 38. She also reported polycystic ovarian syndrome and never conceived. She underwent hysterectomy due to fibroids at the age of 54. She was diagnosed with osteoporosis at the age of 58 and has since received alendronate 70 mg/week.\nIt has not been possible to conduct genetic family screening. Her mother and her maternal aunt displayed a lipodystrophy phenotype with fat loss of upper and lower extremities, presented diabetes from the ages of 25 and 28 respectively, and both showed early presentation of cardiovascular disease, presenting as ischemic stroke at the age of 45 years old and myocardial infarction at the same age, respectively. Her mother had reproductive problems and six miscarriages. Two out of four sisters and one brother developed hypertension and dyslipidemia at a young age.\nA genetic analysis for lipodystrophy was performed and included the sequence and deletion/duplication analysis of the following genes: ADRA2A, AGPAT2, AKT2, BSCL2, CAV1, CAVIN1, CIDEC, FBN1, KCNJ6, LIPE, LMNA, LMNB2, PCYT1A, PIK3R1, PLIN1, POLD1, PPARG, PSMB8, and ZMPSTE24. The analysis revealed a novel heterozygous mutation in the PPARG gene (c470A>G, p. Glu157Gly, exon3) (The University of Chicago Genetic Services Laboratory). This particular amino acid change has not been described in other patients with PPARG-related disorders, but a different pathogenic sequence change affecting the same amino acid residue (p. Glu157Asp) has been described in a family with PPARG-related lipodystrophy (). In our case the substitution of the negative charged glutamic acid at position 157 by the hydrophobic glycine could possibly lead to the formation of a non-functional protein responsible for the lipodystrophy phenotype. According to missense interpretation by experimental report classifier (MITER) the described mutation is associated with 78.6% probability of causing FPLD3 and 6.5-fold increased risk for type 2 diabetes mellitus.\nExamination revealed clinical signs of lipodystrophy of upper and lower limbs and gluteal area. Facial fat and abdominal prominence were also noted. She also had phlebectasia, hirsutism and cervical acanthosis nigricans. The patient mentioned that this phenotype was present from the age of 20 years old. Blood pressure was 175/84 mmHg.She was underweighted with a BMI: 19.40 kg/m2 (weight: 46 kg, height: 154 cm) ().\nTo assess the degree of regional fat loss in this case, we compared the total and proportional fat content in defined body regions using Dual-energy X-ray absorptiometry (DXA) with a group of healthy, lean postmenopausal women (). The case has a relatively short stature and as a consequence a total lean mass not far from the lower end the 95% confidence interval of the comparators. The total fat mass was drastically lower giving a first indication of a lipodystrophic state. The visceral fat mass was similar to the comparators whilst the proportional fat content in extremities was drastically reduced showing the classic features of peripheral fat loss in partial lipodystrophy ().\nAt the time of the first evaluation biochemical measurements revealed glycated hemoglobin (HbA1C) of 10%, a total cholesterol of 132 mg/dl of which high density lipoprotein (HDL-C) was 25 mg/dl. There was severe hypertriglyceridemia at 2.919 mg/dl. Further tests confirmed chronic kidney disease (blood urea nitrogen: 49.6 mg/dl, creatinine: 1.3 mg/dl, eGFR: 43 ml/min) and albuminuria (314 mg/24 h).\nWe performed glucagon stimulation test which revealed residual insulin secretion (fasting C-peptide: 2.09 ng/ml, 6 min after 1 mg of glucagon infusion C-peptide: 3.13 ng/ml). Plasma leptin concentration was close to zero (0.43 ng/ml).\nAbdominal ultrasound confirmed hepatic steatosis and transient elastography (fibroscan) detected liver stiffness of 18 Kpa. Abdominal Magnetic Resonance Imaging (MRI) was unremarkable apart from hepatomegaly with a liver percentage fat fraction of 9.4%, and an enlarged spleen (). Cardiac MRI revealed left ventricular hypertrophy (maximal wall thickness 17 mm) and myocardial fibrosis in the basal interventricular septum (LGE SCORE 1/48, LGE mass 2%). Two-dimensional echocardiography revealed severe left ventricular hypertrophy, minimal mitral regurgitation, and ejection fraction of 60% ().\nAfter noting her poor glycemic control, her antidiabetic treatment was intensified with empagliflozin 10 mg/daily and liraglutide 1.8 mg/daily, but this resulted only in a slight improvement in glycemic control after 3 months (HbA1c: 9.3%), despite additional strict dietetic management, but without any change in insulin management. We did not observe any change in triglyceride (TG) levels.\nMetreleptin was then initiated at 5 mg once daily on top of the current lipid and diabetes management. Glycemic control and hypertriglyceridemia improved within two months of treatment evidenced by decrease of HbA1C from 10 to 8.7% and the reduction of TG from a baseline value of 2.919 to 242 mg/dl. At six months there was further reduction in HbA1C (7.9%) and in TG (198 mg/dl). This improvement was sustained one year after treatment with metreleptin in the same dose (HbA1C: 8%, TG: 185 mg/dl-standard serum determinations are listed in ), (). Insulin doses were reduced from more than 5 to 2.22 IU/kg/day. Blood pressure was also better controlled without any change in anti-hypertensive medication.\nAt six months of metreleptin treatment a reduced liver fat content was observed (MRI estimated liver percentage fat fraction was reduced from 9.4 to 6.8%). However, liver stiffness assessed by transient elastography remained stable. A repeated DXA scan showed unchanged total fat mass content and cardiac MRI revealed no change (). Reduction in appetite following metreleptin treatment was reported. Hunger scales for the assessment of appetite were not used. Metreleptin treatment was well tolerated with no other adverse effects. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "33.001",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.ideal_body_weight import ibw_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\nweight = 46\nweight_unit = \"kg\"\nheight = 154\nheight_unit = \"cm\"\nsex = \"Female\"\nage = 61\nage_unit = \"years\"\ncreatinine_value = 1.3\ncreatinine_unit = \"mg/dL\"\n\ninput_bmi = {\n    \"weight\": (weight, weight_unit),\n    \"height\": (height, height_unit)\n}\nbmi_result = bmi_calculator_explanation(input_bmi)\nbmi = float(bmi_result[\"Answer\"])\n\ninput_ibw = {\n    \"height\": (height, height_unit),\n    \"sex\": sex,\n    \"age\": age\n}\nibw_result = ibw_explanation(input_ibw)\nibw = float(ibw_result[\"Answer\"])\n\ninput_abw = {\n    \"weight\": (weight, weight_unit),\n    \"height\": (height, height_unit),\n    \"sex\": sex,\n    \"age\": age\n}\nabw_result = abw_explanation(input_abw)\nabw = float(abw_result[\"Answer\"])\n\nif bmi < 18.5:\n    final_weight = weight\nelif 18.5 <= bmi < 25:\n    final_weight = min(weight, ibw)\nelse:\n    final_weight = abw\n\ninput_cg = {\n    \"weight\": (final_weight, \"kg\"),\n    \"height\": (height, height_unit),\n    \"sex\": sex,\n    \"creatinine\": (creatinine_value, creatinine_unit),\n    \"age\": (age, age_unit)\n}\nfinal = generate_cockcroft_gault_explanation(input_cg)\nresult = str(final[\"Answer\"])\nprint(result)"
  },
  {
    "question": "A 53-year old man (height, 175 cm; weight, 87 kg) was scheduled to undergo subtotal stomach-preserving pancreatoduodenectomy with portal vein reconstruction for pancreatic cancer after receiving neoadjuvant chemotherapy with gemcitabine and nab-paclitaxel. Laparoscopic left nephrectomy for renal cell carcinoma was performed 1 year prior; therefore, harvesting the left internal jugular vein for portal vein reconstruction was planned because the left renal vein was too short. Preoperative serum creatinine level and potassium level were 1.39 mg/dL and 4.1 mEq/L, respectively.\nGeneral anesthesia was induced rapidly with propofol, rocuronium, fentanyl, and remifentanil and maintained with desflurane. The patient’s vital signs remained stable while resection of the distal stomach, gallbladder, distal common bile duct, and pancreatic head was performed. Bleeding from the first jejunal vein (J1V) occurred during adhesion detachment around the superior mesenteric vein (SMV), and clamping of the J1V was required to control the bleeding. Immediately after J1V clamping, bowel congestion progressed because the patient’s intestinal blood flow had been bypassed from the SMV to the inferior pancreaticoduodenal vein through J1V due to complete obstruction of the portal vein by the tumor. Therefore, a heparin-coated bypass tube (ANTHRON™ bypass tube, TORAY MEDICAL Co., Tokyo, Japan) was inserted from the SMV to the right great saphenous vein to relieve the bowel congestion. Several minutes after insertion of the ANTHRON™ bypass tube, blood potassium level rose from 4.7 mEq/L to 6.0 mEq/L, and pulseless ventricular tachycardia occurred. Chest compression was promptly performed by surgeons, and anesthesiologists attempted direct current defibrillation several times; epinephrine, magnesium sulphate, bicarbonate, lidocaine, and amiodarone were also administered. In addition to resuscitation, anesthesiologists inserted a blood-access catheter to the right internal jugular vein and started continuous renal replacement therapy to prevent elevation of blood potassium level. Spontaneous circulation was recovered after 30 min. The surgical team decided to discontinue the surgery, and the patient was transferred to the intensive care unit (ICU) after packing gauze into the abdomen and with the ANTHRON™ bypass tube left inserted. Total blood loss was 5620 mL, and total fluid balance was + 6115 mL. The operation time was 10 h 30 min.\nTwo days after the first operation, the patient was scheduled to undergo tumor resection and portal vein reconstruction with REIV. The surgical team abandoned using the left internal jugular vein for portal vein reconstruction because of concerns that brain congestion after harvesting the jugular vein could affect brain function recovery. Anesthesia was maintained with dexmedetomidine, fentanyl, rocuronium, and remifentanil. Continuous hemodiafiltration had been performed in the ICU due to persistent anuria and continued during the operation to prevent hyperkalemia. Both legs were compressed with a pneumatic compression device throughout the operation to prevent deep venous thrombosis formation. A section of the REIV 5 cm in length was harvested intraperitoneally with a surgical stapler, and the REIV distal end was closed with a 4-0 polypropylene running suture. The inferior epigastric vein, pubic branch of the obturator vein, and the deep circumflex iliac vein were preserved. A surgical nurse noticed swelling of the patient’s right leg 2 h after harvesting; the surgical team ensured careful observation throughout the surgery because a transient change by congestion of the right leg was suspected. Blood potassium level was slightly elevated after REIV resection, but ventricular arrhythmia was absent. Surgery was completed as scheduled (operation time, 7 h 3 min), and the patient was transferred to the ICU again. Total blood loss and total fluid balance were 2485 mL and + 2587 mL, respectively.\nOn ICU admission, distention and fullness of the right leg worsened. An orthopedist diagnosed the patient with acute compartment syndrome, and right leg elevation to lower the intracompartmental pressure was initiated. Blood potassium level was rapidly elevated immediately after leg elevation (Fig. ), which caused sustained ventricular tachycardia despite efforts to lower blood potassium level such as the administration of bicarbonate, glucose-insulin, and continuous hemodialysis with potassium-free dialysate. Chest compressions were initiated immediately. Ventricular tachycardia was prolonged; therefore, veno-arterial extracorporeal membrane oxygenation (V-A ECMO) was induced, and spontaneous circulation was recovered after resolution of hyperkalemia (Fig. , Table ). Emergent fasciotomy was performed by orthopedists 1 h after induction of V-A ECMO because the intracompartmental tissue pressure of the anterior compartment was 70 mmHg.\nV-A ECMO was withdrawn 2 days later, and the patient was extubated 10 days after portal vein reconstruction. He had no apparent neural deficits; however, paralysis and paresthesia of the right leg persisted after discharge from the ICU 17 days post-operatively. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "67.005",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.ideal_body_weight import ibw_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\nweight = 87\nweight_unit = \"kg\"\nheight = 175\nheight_unit = \"cm\"\nsex = \"Male\"\nage = 53\nage_unit = \"years\"\ncreatinine_value = 1.39\ncreatinine_unit = \"mg/dL\"\n\n# Calculate BMI\nbmi_in = {\n    \"weight\": (weight, weight_unit),\n    \"height\": (height, height_unit)\n}\nbmi_val = float(bmi_calculator_explanation(bmi_in)[\"Answer\"])\n\n# Calculate IBW\nibw_in = {\n    \"height\": (height, height_unit),\n    \"sex\": sex,\n    \"age\": age\n}\nibw_val = float(ibw_explanation(ibw_in)[\"Answer\"])\n\n# Set ABW according to BMI rules\nif bmi_val < 18.5:\n    abw_final = weight\nelif 18.5 <= bmi_val < 25:\n    abw_final = min(weight, ibw_val)\nelse:\n    abw_in = {\n        \"weight\": (weight, weight_unit),\n        \"height\": (height, height_unit),\n        \"sex\": sex,\n        \"age\": age\n    }\n    abw_final = float(abw_explanation(abw_in)[\"Answer\"])\n\n# Calculate Creatinine Clearance using the adjusted/selected body weight\ncc_in = {\n    \"weight\": (abw_final, \"kg\"),\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"creatinine\": (creatinine_value, creatinine_unit),\n    \"age\": (age, age_unit),\n}\nresult = generate_cockcroft_gault_explanation(cc_in)[\"Answer\"]\nprint(result)"
  },
  {
    "question": "A 51-year-old lady presented to our emergency department because of generalized body ache and marked weakness in both lower extremities for two days duration. She had no history of vomiting, diarrhea, frequent urination, recent use of laxatives or diuretics, current or previous use of lithium, licorice ingestion, or activities leading to profuse sweating. Past medical history was significant for type 2 diabetes mellitus, hypertension, seizure disorder and schizoaffective disorder. She also had a long-term history of alcoholism, consuming two to three pints of vodka every day for about 20 years. Her last drink of alcohol was about 48 hours prior to presentation. On examination, her weight was 79 kg, height 65 inches, body mass index 29.3 kg/m2. Vital signs were stable, temp 98.6°F, heart rate 68 bpm, respiratory rate 18, blood pressure 113/71 mmHg and oxygen saturation 98% on room air. She was alert and oriented, there was no thyromegaly or lymphadenopathy. Cardiac examination revealed a regular sinus rhythm with no murmurs. There were no deformities or edema of the extremities and distal pulses were present. There was no cushingoid facies, buffalo hump or abdominal striae noted. Neurological examination revealed bilateral lower limb weakness of 4/5, with intact sensory system and reflexes. Cranial nerve examination was unremarkable.\nBiochemical analysis of the serum showed severe electrolyte disturbances, a potassium level of 2.3 mmol/L (reference 3.6−5.1 mmol/L), magnesium level of 0.9 mg/dL (reference 1.8−3.0 mg/dL), phosphorus level of 2.0 mg/dL (reference 2.4−4.6 mg/dL), corrected calcium level of 7.8 mg/dL (reference 8.9−10.3 mg/dL). Renal function was mildly deranged with Creatinine of 1.35 mg/dL (reference 0.4−1.3 mg/dL) and BUN of 12 mg/dL (reference 8−20mg/dL). The results of hepatic enzymes, AST 113 IU/l (reference 15−41 IU/l), ALT 42 IU/l (reference 17−63 IU/l) was suggestive of alcohol induced hepatic damage. Electrocardiogram (ECG) () showed no arrhythmias, but changes characteristic of hypokalemia with increased amplitude of the U-wave and marked corrected QT segment prolongation (QTc 551 ms). Patient was admitted to intensive care unit for severe hypokalemia management and cardiac monitoring. Aggressive supplementation of electrolytes was initiated (), however despite supplementation with enteral and parenteral potassium as well as magnesium and phosphate, potassium level failed to increase () and subsequently she had a sinus bradycardia followed by asystole. Cardiopulmonary resuscitation was initiated when asystole was noted, return of spontaneous circulation was obtained after 8 minutes of resuscitation. Patient was mechanically ventilated for two days and her own efficient respiration was reestablished, then she was successfully extubated. During the following days, the patient was conscious, alert and oriented to time, place and person. Further laboratory testing revealed thyroid- stimulating hormone level was 1.100 mIU/L (reference 0.45−4.50 mIU/L). Active renin level was 0.653ng/ml/hr (reference 0.167−5.38 ng/ml/hr), aldosterone levels was <0.01 ng/dL (reference 0.00− 30 ng/dL). Creatine kinase (CK) level was 6922 U/L (reference 38–297 IU/L), indicating rhabdomyolysis. The arterial blood gas analysis revealed pH of 7.430, partial pressure of carbon dioxide was 29 mmHg; partial pressure of oxygen was 74 mmHg; HCO3 was 25 mmol/L and base excess of -4.7 mmol/L. Urinalysis showed dilute urine of 1.010 g/mL specific gravity (reference 1.005 to 1.030), Urine pH of 6.5, and no proteinuria. Urine electrolytes were measured on spot urine analysis and twenty-four-hour urine collection, result depicted in . Serial electrocardiogram monitoring showed resolution of ECG changes (). Follow up laboratory tests revealed normalization of electrolytes level (). Post cardiac arrest serial ECGs didn’t reveal any ischemic changes, cardiac enzymes were not elevated and echocardiogram revealed normal left ventricular systolic function, Ejection Fraction of 60–65%. Cardiac arrest was presumed to be secondary to severe hypokalemia and there was no necessity for further cardiac evaluation. She was then discharged from the hospital with recommendations for abstinence from alcohol. Follow up outpatient appointment with primary care physician was provided. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "51.212",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\n# Patient parameters\nweight = 79\nheight_in = 65  # inches\nheight_cm = height_in * 2.54\nsex = \"Female\"\nage = 51\ncreatinine = 1.35\n\n# Step 1: Calculate BMI\nbmi_input = {\n    \"weight\": (weight, \"kg\"),\n    \"height\": (height_in, \"in\")\n}\nbmi_result = bmi_calculator_explanation(bmi_input)\nbmi_val = float(bmi_result[\"Answer\"])\n\n# Step 2: Calculate IBW and ABW\nabw_input = {\n    \"weight\": (weight, \"kg\"),\n    \"height\": (height_cm, \"cm\"),\n    \"sex\": sex,\n    \"age\": age\n}\nabw_result = abw_explanation(abw_input)\nabw_kg = float(abw_result[\"Answer\"])\n\n# Step 3: Determine which weight to use (adjusted/IBW or actual) for Cockcroft-Gault\n# BMI 29.3 is normal/overweight but below 30, so use min(IBW, actual) as per instruction.\n# The adjusted algorithm (from your prompt): if BMI normal, set to min(IBW, actual); underweight, use actual; overweight/obese, use ABW.\nif bmi_val < 18.5:\n    use_weight = weight\nelif 18.5 <= bmi_val < 25:\n    use_weight = min(abw_kg, weight)\nelif 25 <= bmi_val < 30:\n    use_weight = min(abw_kg, weight)\nelse:\n    use_weight = abw_kg\n\n# Step 4: Creatinine Clearance calculation\ncg_input = {\n    \"weight\": (use_weight, \"kg\"),\n    \"height\": (height_cm, \"cm\"),\n    \"sex\": sex,\n    \"creatinine\": (creatinine, \"mg/dL\"),\n    \"age\": (age, \"years\")\n}\ncg_result = generate_cockcroft_gault_explanation(cg_input)\nresult = str(cg_result[\"Answer\"])\nprint(result)"
  },
  {
    "question": "A 43-years-old Caucasian male (height 198 cm, weight 115 kg, tobacco smoker – 1 packet of cigarettes/day) was admitted to the intensive care unit (ICU) of a university hospital from a municipal hospital because of multiorgan dysfunction syndrome associated with infection and necrosis of the skin, subcutaneous tissue, and fascia of the left lower leg. The signs and symptoms of the disease – edema and pain affecting the left leg-began 7 days before admission. The patient's medical history was significant for hepatitis C (HCV), treated with ribavarin and interferon, and diabetes mellitus treated with insulin. On the day of admission the HCV-RNA test was negative. A mosquito bite was the probable triggering event.\nOn admission to the ICU the patient was confused, with a Glasgow Coma Scale (GCS) of 9. He was afebrile, had tachycardia, with a heart rate of 120 beats per minute, hypotension, with a blood pressure of 90/50 mmHg, and relative respiratory insufficiency (oxygen saturation of 88% – 90%). He had moderately-dilated pupils with a delayed light reflex. We noted crepitus over the bilateral lung fields, a tender abdomen with absent bowel sounds, and oliguria. There were numerous hemorrhagic extravasations on the skin. Examination of the left leg revealed diffuse edema of the skin, with marked erythema and necrosis; margins of infection were sharply demarcated, spreading onto the buttock and perineum on the left side (Figure ). Laboratory tests showed a metabolic acidosis, with the following values: base excess -15 mmol/l, lactate level 7.3 mmol/l, PaO2 64 mmHg, platelet count 29,000/mm3, International Normalized Ratio (INR) 2.24, serum creatinine 691.6 μmol/l, bilirubin 62.6 μmol/l, and C-reactive Protein (CRP) 224.6 μg/dl.\nThe Acute Physiology and Chronic Health Evaluation (APACHE) II score on the day of admission was 31 points and the Sequential Organ Failure Assessment (SOFA) score was 18 points. The patient required fluid resuscitation, endotracheal intubation, mechanical ventilation in BiPAP (bilevel positive airway pressure) mode, continuous intravenous infusion of catecholamines (epinephrine, norepinephrine) and low doses of steroids to restore blood pressure. After obtaining cultures from the affected tissue, blood and bronchoalveolar lavage (BAL) in appropriate media, empirical, broad-spectrum antibiotics were immediately administered (meropenem 3 g/day in a 3-h infusion, vancomycin 3 g/day in continuous infusion, metronidazole 1.5/day in 3 divided doses). Because of progressive organ dysfunction, therapy was started with activated protein C, in doses of 24 μg/kg/h; continuous veno-venous hemofiltration (CVVH) was also started. After several hours, the patient developed atrial fibrillation with a ventricular rate of 140 beats per minute and his blood pressure decreased to 80/50 mmHg. Electrical cardioversion was performed three times, followed by continuous infusion of cordarone (12 mg/kg/day). During this time, intensive fluid resuscitation was administered. During the first day, the patient received 12,800 ml of fluid (colloids and crystalloids). His unstable condition did not allow for early surgical management.\nThe cultures from the affected areas of skin contained Streptococcus pyogenes and Staphylococcus sciuri. Based on sensitivity results, vancomycin and metronidazole were discontinued, and penicillin G was started at a dose of 60 million units a day (intravenous) in 6 divided doses. Because the patient's poor condition persisted and the microbes were sensitive to clindamycin, it was added at 2.7 g/day in 3 divided doses. In spite of the lack of information about G-pathogens, meropenem was continued. The patient also received 40 g of commercially available gamma-globulin (intravenous), 8 units of packed red blood cells, 6 units of fresh frozen plasma, and 8 units of platelets. After several days his condition improved, with urine output of 100–150 ml/h and resolution of his metabolic acidosis. On the sixth day, the patient's hemodynamic parameters deteriorated again, with tachycardia to 160 beats per minute and a decrease in blood pressure to 85/60 mmHg. CVVH was administered again for detoxification. On the seventh day, the necrotic tissue was surgically excised (Figures , ). We also noted a progressive decline in the white blood cell count to 2,200/mm3, and administered granulocyte colony stimulating factor.\nCultures of the BAL showed 104 colony-forming units/ml of methycillin resistant Staphylococcus aureus (MRSA). (The patient had been a carrier of methycillin susceptible Staphylococcus aureus [MSSA] isolated from his nose vestibule on admission.) Because MRSA also was present in blood cultures and the patient's condition remained poor, linezolid 1.2 g a day in 2 divided doses was initiated based on additional results of susceptibility tests. After 10 days of intensive treatment, the patient was hemodynamically stable, and we discontinued mechanical ventilation. 25 days after admission the patient was discharged to the trauma surgery ward for plastic reconstruction of his wounds. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "17.406",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.ideal_body_weight import ibw_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\nweight = 115\nheight = 198\nsex = \"Male\"\nage = 43\ncreatinine = 691.6\ncreatinine_unit = \"μmol/L\"\n\nbmi_inputs = {\n    \"weight\": (weight, \"kg\"),\n    \"height\": (height, \"cm\"),\n}\nbmi = float(bmi_calculator_explanation(bmi_inputs)[\"Answer\"])\n\nibw_inputs = {\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"age\": age,\n}\nibw = float(ibw_explanation(ibw_inputs)[\"Answer\"])\n\nabw_inputs = {\n    \"weight\": (weight, \"kg\"),\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"age\": age,\n}\nabw = float(abw_explanation(abw_inputs)[\"Answer\"])\n\nif bmi < 18.5:\n    adjusted_weight = weight\nelif bmi >= 25:\n    adjusted_weight = abw\nelse:\n    adjusted_weight = min(ibw, weight)\n\ncreatinine_clearance_inputs = {\n    \"weight\": (adjusted_weight, \"kg\"),\n    \"height\": (height, \"cm\"),\n    \"sex\": sex,\n    \"creatinine\": (creatinine, \"μmol/L\"),\n    \"age\": (age, \"years\"),\n}\nresult = str(generate_cockcroft_gault_explanation(creatinine_clearance_inputs)[\"Answer\"])\nprint(result)"
  },
  {
    "question": "A 65-year-old female consulted our office for naturopathic primary-care support for a myriad of conditions, which included diabetes with weight gain, chronic fatigue, depression with emotional lability, frequent colds, and recurrent urinary tract infections. The latter was attributed to a medullary sponge kidney as was her history of kidney stones and hypertension. The patient also suffered with long-standing acid reflux and was prone to irritable bowel with diarrhea. She had also suffered with multiple abscesses in the past as well as poor generalized wound healing. A history of fibroadenomas was also noted. The patient recollected, “never being well”, even as a child. She described her diet as a child as “deficient” and consisted mostly of canned beans and bread, which she attributed to her poor socioeconomic status as a child.\nPharmacological management of her diabetic condition included the use of metformin/sitagliptin (1,000 mg/50 mg, taken twice per day) and gliclazide (30 mg), also taken twice per day.\nAdditional medications included ramipril (5 mg/day), ranitidine (150 mg, twice per day), low-dose aspirin (81 mg/ day), hydrochlorothiazide (25 mg/day), allopurinol (100 mg/ day), citalopram (40 mg/day), and mirabegron (50 mg/day).\nPhysical examination revealed a 1.69 m (66.5 inch), 88.5 kg (195.0 lb) female. Body mass index was calculated at 31.0 (Obese Class I) (32). Central waist measurement was 112 cm, while her hips measured 118 cm. Blood pressure was 114/64 mmHg, measured at the left brachial artery. Bioimpedance analysis revealed a lean body mass of 49.9 kg (111.0 lbs) and a fat mass of 38.0 kg (84.0 lbs).\nLaboratory assessment prior to date of initial consult (June 2017) revealed a HBA1C of 7.8% and a random glucose of 6.5 mmol/L. Total cholesterol (TC) was 4.68 mmol/L, triglycerides (TG) were 2.63 mmol/L, high-density lipoproteins (HDL) was 1.04 mmol/L, low-density lipoproteins (LDL) was 2.44 mmol/L, and TC:HDL was 4.5. Alanine aminotransferase was 55 U/L, while creatinine was 79 μmol/L. What is the patient's Creatinine Clearance using the Cockroft-Gault Equation in terms of mL/min? You should use the patient's adjusted body weight in kg instead of the patient's actual body weight if the patient is overweight or obese based on their BMI. If the patient's BMI's normal, set their adjusted body weight to the minimum of the ideal body and actual weight. If the patient is underweight, please set their adjusted body weight to their actual body weight.",
    "final_answer": "70.556",
    "metadata": {
      "calc_name": "Creatinine Clearance (Cockcroft-Gault Equation)"
    },
    "rationale": "from medcalc.bmi_calculator import bmi_calculator_explanation\nfrom medcalc.adjusted_body_weight import abw_explanation\nfrom medcalc.creatinine_clearance import generate_cockcroft_gault_explanation\n\n# Step 1: BMI\nbmi_input = {\n    \"weight\": (88.5, \"kg\"),\n    \"height\": (169, \"cm\"),\n}\nbmi_result = bmi_calculator_explanation(bmi_input)\nbmi = float(bmi_result[\"Answer\"])\n\n# Step 2: Adjusted Body Weight\nabw_input = {\n    \"weight\": (88.5, \"kg\"),\n    \"height\": (169, \"cm\"),\n    \"sex\": \"Female\",\n    \"age\": 65,\n}\nabw_result = abw_explanation(abw_input)\nabw = float(abw_result[\"Answer\"])\n\n# Step 3: Creatinine Clearance (Cockcroft-Gault)\ninput_variables = {\n    \"weight\": (abw, \"kg\"),\n    \"height\": (169, \"cm\"),\n    \"sex\": \"Female\",\n    \"creatinine\": (79, \"μmol/L\"),\n    \"age\": (65, \"years\"),\n}\ncg_result = generate_cockcroft_gault_explanation(input_variables)\nresult = str(cg_result[\"Answer\"])\nprint(result)"
  }
]